---
kind: property
id: P:Autodesk.Revit.DB.ImageExportOptions.ZoomType
source: html/a3e468fa-4a19-bb8a-1029-8ab47806975c.htm
---
# Autodesk.Revit.DB.ImageExportOptions.ZoomType Property

The zoom type, which defines how the image size is determined.

## Syntax (C#)
```csharp
public ZoomFitType ZoomType { get; set; }
```

## Remarks
The default is FitToPage.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration